reindex(), fill_vaule(), fillna() <hr>

In [2]:
import pandas as pd

dataSR = pd.Series(['A', 'B', 'C'], index=['하나', '둘', '셋'])
print(dataSR)
# 하나    A
# 둘     B
# 셋     C

# 인덱스를 재지정
dataSR2 = dataSR.reindex(['셋', '하나', '넷'], fill_value=1)
dataSR2.fillna(0, inplace= True)
print(dataSR2)

하나    A
둘     B
셋     C
dtype: object
셋     C
하나    A
넷     1
dtype: object

공백 삭제, 대소문자 반환 D1022 <hr>

In [3]:
## Series 인스턴스 생성
dataSR = pd.Series( [ "  Hello, World!  ",
                      "Pandas_is_FUN",
                      "email: user01@example.com",
                      None
])
## 1) 공백 제거 & 소문자화
## strip() : 좌우 공백 제거
print( dataSR.str.strip() )

## strip() 공백 제거 결과 + lower() 소문자 변환
print(dataSR.str.strip().str.lower())

0                Hello, World!
1                Pandas_is_FUN
2    email: user01@example.com
3                         None
dtype: object
0                hello, world!
1                pandas_is_fun
2    email: user01@example.com
3                         None
dtype: object

필터링 D1023 <hr>

In [4]:
dataDF  = pd.DataFrame({'num_legs': [2, 4, 4], 
                        'num_wings': [2, 0, 0]},
                       index=['falcon', 'dog', 'cat'])
display( dataDF )
resultDF = dataDF.isin([0, 2])
display(resultDF)
resultDF = dataDF.isin({'num_wings':[0, 3]})
display(resultDF)

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0

        num_legs  num_wings
falcon      True       True
dog        False       True
cat        False       True

        num_legs  num_wings
falcon     False      False
dog        False       True
cat        False       True

mask 변수로 필터링

In [5]:
# mask = (dataDF.survived == 1) & ((dataDF.age>=30) & (dataDF.age<40)) & (dataDF.sex == 'female')
# mask

# dataDF[mask]

type변환

In [6]:
## DF 인스턴스 생성
df = pd.DataFrame({
    "age"   : ["23", "45", "30"],                           # 문자열 숫자 *
    "height": [170.5, 180.2, 160.3],                        # 실수
    "passed": [1, 0, 1],                                    # 정수 (0/1) *
    "name"  : ["Ann","Hong","Lee"],                         # 문자열
    "birth" : ["2020-10-01","2000-01-01", "2005-12-24"],    # 문자열 날짜 *
    "gender": ["F", "M", "F"]                               # 문자열      *
})

## 컬럼별 타입 정보 => dtypes
print("변환 전:\n", df.dtypes)

변환 전:
 age        object
height    float64
passed      int64
name       object
birth      object
gender     object
dtype: object

D1024 <hr>

In [9]:
## 데이터 확인
DATA_FILE = '../EX_PANDAS/Data/auto_mpg.csv'
mpgDF = pd.read_csv(DATA_FILE)

## 실제 데이터
display(mpgDF.head())

## 데이터프레임 전반적인 정보 : 행/샘플 수, 컬럼수, 컬럼별 결측치, 컬럼별 타입
mpgDF.info()

## 컬럼별 상세 => 데이터 분포 및 의미기반 타입 
mpgDF = mpgDF.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [ ]:
## 관계성 확인
mpgDF.corr(numeric_only=True)

,mpg,cylinders,displacement,weight,acceleration,model year,origin
mpg,1.000000,0.996984,0.584019,-0.461526,0.998833,0.984716,0.996222
cylinders,0.996984,1.000000,0.522148,-0.527378,0.999417,0.979353,0.999933
displacement,0.584019,0.522148,1.000000,0.398750,0.544430,0.573511,0.514661
weight,-0.461526,-0.527378,0.398750,1.000000,-0.500265,-0.402038,-0.535977
acceleration,0.998833,0.999417,0.544430,-0.500265,1.000000,0.984085,0.999061
model year,0.984716,0.979353,0.573511,-0.402038,0.984085,1.000000,0.977687
origin,0.996222,0.999933,0.514661,-0.535977,0.999061,0.977687,1.000000

In [ ]:
## 시리즈 정렬
mpg_corrSR = mpgDF.corr(numeric_only=True).loc['cylinders':,'mpg']
mpg_corrSR.sort_values()

weight         -0.461526
displacement    0.584019
model year      0.984716
origin          0.996222
cylinders       0.996984
acceleration    0.998833
Name: mpg, dtype: float64

In [ ]:
## 중복 행 처리
## 데이터 준비
df = pd.DataFrame({ 'brand' : [ 'Yum', 'Yum', pd.NA, 'Indo', 'Indo' ],
                    'style' : [ 'cup', 'cup', 'cup', 'pack', 'pack' ],
                    'rating' : [4, 4, 3.5, 15, 5] })
display(df)
## 중복체크
result = df.duplicated().sum()


print(f'중복 데이터/행 : {result}개')

## 중복체크 - 마지막 유지, 그 외 중복
result = df.duplicated(keep='last')
result

## 중복체크 - 모두 중복
result = df.duplicated(keep=False)
result
## brand 컬럼만 중복인 행
result = df.duplicated(subset='brand')
result

  brand style  rating
0   Yum   cup     4.0
1   Yum   cup     4.0
2  <NA>   cup     3.5
3  Indo  pack    15.0
4  Indo  pack     5.0

중복 데이터/행 : 1개

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [ ]:
## 결측치 제거

#결측치 존재 인덱스 제거
df.dropna(subset = ['brand'])

#결측치 치환
df.fillna(value=0)

## 앞값으로 치환
display(df.ffill())

## 뒷값으로 치환
display(df.bfill())

  brand style  rating
0   Yum   cup     4.0
1   Yum   cup     4.0
2   Yum   cup     3.5
3  Indo  pack    15.0
4  Indo  pack     5.0

  brand style  rating
0   Yum   cup     4.0
1   Yum   cup     4.0
2  Indo   cup     3.5
3  Indo  pack    15.0
4  Indo  pack     5.0

In [ ]:
## groupby

df.groupby('brand')['rating'].median()

brand
Indo    10.0
Yum      4.0
Name: rating, dtype: float64

In [ ]:
## 필터
df.groupby('brand').filter(lambda x : x['rating'].sum() >= 9.0)

  brand style  rating
3  Indo  pack    15.0
4  Indo  pack     5.0

In [ ]:
## 합치기 
## DataFrame 인스턴스 생성
df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                    'b':['b0','b1','b2','b3'],
                    'c':['c0','c1','c2','c3']})

df2 = pd.DataFrame({'a':['a2','a3','a4','a5'],
                    'b':['b2','b3','b4','b5'],
                    'c':['c2','c3','c4','c5'],
                    'd':['d2','d3','d4','d5']},
                    index=[2,3,4,5])

display(df1)
display(df2)

dataDF = pd.concat([df1,df2],axis = 1, join = "inner")
dataDF

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3